<!DOCTYPE html PUBLIC >
<html lang="es">
    <head>
        <meta charset="UTF-8">
        <meta name="description" content="Diferencias entre la Web 1, 2, 3 y 4">
        <meta name = "author" content="Alan Carmona">
        <meta name = "keywords" content="palabras, clave">
        <meta name ="copyright" content= "Albert">

        <title>Web 1.0, 2.0, 3.0 y 4.0</title>
    </head>
    <body bgcolor ="antiquewhite">
        <h1>Web 1.0</h1>
        <br> <!--Salto de línea.  <br/> para (estándar XHTML 1)-->
        <p>La Web 1.0 era solo de lectura, el usuario no puede interactuar con el contenido de la p&aacute;gina (nada de comentarios, respuestas, citas, etc.). Esto estaba limitado a lo que el WebMaster sube a la página.</p>
        <img src="https://smdigital.com.co/wp-content/uploads/2017/05/la-web-1-0-interna01-1.png" width="500">
        <h2>Algunas caracter&iacute;sticas</h2>
        <ul>
            <li>Las p&aacute;ginas son est&aacute;ticas, muy pocas veces din&aacute;micas.</li>
            <li>No se actualizaban tan seguido.</li>
            <li>No se pueden adherir comentarios.</li>
            <li>hace uso de marcos.</li>
            <li>libros de vistas online.</li>
        </ul>
        <img src="https://s3.amazonaws.com/s3.timetoast.com/public/uploads/photo/13761420/image/eaafa41e7fcd054aaa55fa3786552a87" width="400">
        <br> <br>
        <h1>Web 2.0</h1>
        <br>
        <p>La Web 2.0 ha logrado ofrecer al usuario gran cantidad de recursos de software gratuito, dándole la posibilidad a éste de publicar información en la web. Permite que los contenidos son también construidos y viralizados por los propios usuarios.
        </p>
        <h2>Algunas caracter&iacute;sticas</h2>
        <ul>
            <li>Simplifica la usabilidad del sitio web.</li>
            <li>Ahorra tiempo del usuario.</li>
            <li>Facilita la publicaci&oacute;n, la investigaci&oacute;n y la consulta de contenido.</li>
            <li>Facilita las interacciones.</li>
            <li>Estandariza los lenguajes.</li>
            <li>Mejora la interacci&oacute;n con el software y el hardware.</li>
            <br>
            <img src="https://s3.amazonaws.com/s3.timetoast.com/public/uploads/photo/9062115/image/08b9bc679d6f95c604890812dcaeeb1c" width="400">
        </ul>
        <br> <br>
        <h1>Web 3.0</h1>
        <br>
        <p>La web 3.0 es un neologismo que se a utilizado para describir la evoluci&oacute;n del uso y la interacci&oacute;n en la red a trav&eacute;s de diferentes caminos. En eso se incluye las caracter&iacute;sticas siguientes:
        </p>
        <h2>Algunas caracter&iacute;sticas</h2>
        <ul>
            <li>La transformaci&oacute;n de la red en una base de datos.</li>
            <li>La innovaci&oacute;n de las tecnolog&iacute;as en la inteligencia artificial.</li>
            <li>Se implementa la web sem&aacute;ntica, la web geoespacial y la web 3D.</li>
            <br>
            <img src="https://disenowebakus.net/imagenes/articulos/web-3.jpg" width="400">
        </ul>
        <br> <br>
        <h1>Web 4.0</h1>
        <br>
        <p>La web 4.0 propone un nuevo modelo de interacci&oacute;n con el usuario m&aacute;s completo y personalizado, no limit&aacute;ndose simplemente a mostrar informaci&oacute;n, sino comport&aacute;ndose como un espejo m&aacute;gico que de soluciones concretas a las necesidades del navegante.
        </p>
        <h2>Algunas caracter&iacute;sticas</h2>
        <ul>
            <li>Nuevos modelos de interacci&oacute;n con el usuario.</li>
            <li>Nuevos modelos de comunicaci&oacute;n entre m&aacute;quina-m&aacute;quina.</li>
            <li>Comprensi&oacute;n del lenguaje natural(NLU).</li>
            <li>Uso de informaci&oacute;n del usuario como pueden ser la geolocalizaci&oacute;n, sensores y an&aacute;lisis de datos.</li> 
            <br>
            <img src="https://programacionwebluz.files.wordpress.com/2014/02/044c4-yari4-0.png" width="400">
        </ul>
    </body>
</html>